{
  "post-marketing-safety-operations": {
    "id" : 1,
    "title":"Post Marketing Safety Operations",
    "content" : [
      "Post marketing safety operations are an important practice for monitoring the safety of a pharmaceutical drug or a medical device. It is a significant aspect to highlight the potential safety concern of drug/ device concerned. Post marketing operations conduct an active surveillance to monitor the safety and efficacy. It is a proactive procedure to collect and review the experience of the patients while using the drug or device. It is also a substantial mechanism to put a process in place for the purpose of identifying an immediate need to apply necessary corrective or preventive actions.", 
      "At OrciMed we bring the expertise in providing end to end solutions for ICSR processing requirements including literature surveillance. We are proud to have the capability to set up medical information call center with skilled professionals. We have also developed proficiency in identifying the redundant fields of case processing where we can bring in robotic process automation (RPA) to take care of the data entry. Our expert team hence focuses on critical fields to provide their medical knowledge to write narratives, validate the data and thus reduce the timeline required for case processing. The eminent team delivers customized valuable compilation and submission of an aggregate report to assigned regulatory authorities over the period of the product life cycle. We also provide value added services in risk evaluation and mitigation strategy to ensure the benefits of the approved drug outweigh the risk. The team plays a vital role in handling risk management plans, company core data sheet updates and SmPc updates for medicinal products."],
    "image1": "./Health-economics-outcomes-research.jpg",
    "image2" : "./Post-Marketing-Safety-Operations.jpg",
    "Pharmacovigilance" :[
      {
        "title": "Medical information call center setup",
        "description": "Medical information call centers play a key role in the post marketing surveillance. The trained professionals provide precise validated information on medicinal products and their safety use. The expert team would be responsible to provide therapeutic details, scientific information and product details which in turn supports health care professionals, patients to understand the safety and efficacy of the medicinal product or the product quality complaints. As an integral part of the post marketing surveillance the call center professionals are trained to capture the adverse event form by precisely querying for relevant information to complete the adverse event form. This is a round the clock set up to address the queries of the health care professionals, patients, care takers with the right to information as well consider collecting the adverse event experienced by the patients. The expert team ensures to maintain the confidentiality of the data privacy, and enabled confidential transfer of the data to the sponsor."
      },
      {
        "title": "End to End case processing",
        "description": "Our expert team provides immaculate end to end case processing services throughout the life cycle of the medicinal product. It is imperative that the volume of the case reports generated during post marketing is much higher compared to other phases of the clinical trial. We possess the perfect team who bring in tremendous knowledge in various therapeutic segments and also manage case processing of high volume drugs/ medicinal product. The team is well versed in processing case reports in various databases. Over the years of experience, we have had an opportunity to plug in robotic process automation (RPA) to certain fields that have redundant, yet important information for a complete case report. This has enabled us to reduce the timeline in processing of a case report since our experts focus on the important data points and validate the information that were automatically transcribed to the database via RPA. The strategic way to assured quality of a case report is achieved by implementation of ‘Do it right the first time’ and quality check points implemented at different levels of case processing."
      },
      {
        "title": "Aggregate reports",
        "description": "Aggregate reporting involves the compilation of the cumulative safety data for a medicinal product from a wide range of sources for a designated period of time as described by the reporting country regulatory authority. These aggregate reports are submitted to regulatory authority as soon as the medicinal product is marketed anywhere in the world. These reports empower to understand the benefit risk profile of the medicinal product over a period of time. These reports require distinctive diligence to detail the safety and efficacy of the medicinal product. The eminent team at our company are well versed with the PSUR structure and the format described in the Regulation Article 35 and Module VII of the Guidelines on good pharmacovigilance practices. The expert team manages the data lock points published by the EURD list and submits the reports in a timely manner. The team also expertise’s in managing the PBRER report as described by ICH-E2C (R2) guideline which is used as a basis for the EU PSUR. The team conspicuously highlights on the risk management initiative to the regulatory authorities. The renowned aggregate reporting scientists add value in the development of PADER reports as a part of the post cumulative safety reports to the USFDA."
      },
      {
        "title": "Risk management Plans",
        "description": "Risk management plan is a key to success of any medicinal product released to the market. The risk management plan further emphasizes on the activities of the marketing authorization holder to supplement the characterization of safety profile during post marketing surveillance. We have the privilege of working for different regulatory requirements and customizing the reports to include the identification, analysis, planning, mitigation and monitoring. The team expertise in writing the contingency plans to mitigate and monitor the risk involved. The team also proposes the best practices to measure the effectiveness of risk-minimization measures. The team also addresses the classification of changes to the RMP, submission requirements and many more aspects to be considered in the procedures involved in the management of RMP. The team also has knowledge on working on stand- alone variation document for changes in safety concerns that needs to be submitted outside another procedure."
      },
      {
        "title": "Risk Evaluation and Mitigation strategies",
        "description": "A risk evaluation and mitigation strategy is a drug safety program in the United States food and drug administration. This is required for certain medicinal products with serious safety concerns where the volume of serious adverse events recorded is higher to help ensure the benefits of the medicinal product outweigh the risks. The purpose of this strategic document is to strengthen the medication use behavior and actions that favors the safe use of the medicinal product. The skilled team have experience to reinforce the communication to health care providers in the medication prescribing information. The team focus on preventing and managing the serious risk by informing, educating and reiterating actions to reduce the frequency and severity of the serious event. The expert team provides support for any FDA inspections to evaluate compliance with risk evaluation and mitigation strategies requirement. The team provides their expert advice on best practices to implement risk-based approach."
      },
      {
        "title": "Literature screening and review",
        "description": "Scientific and medical literature is the prime source of information to understand the suspected serious adverse event case reports. It is the need of the hour in the post marketing safety operations to understand the safety and efficacy of the medicinal product. The screening and review process enables to bring in clarity and focus on the medicinal product. It also enhances to broaden our knowledge base and interpret ate the findings for further surveillance. Our expert team screens the literature to identify adverse event reactions or any other relevant information. The team focus on identifying records such as individual case reports, PSURs, PBRER and DSUR. The team emphasis on safety information to be monitored by marketing authorization holders on off-label use, misuse, drug abuse, drug-drug interactions. The proficient team provides periodic screening of literature review in most of the widely used reference databases such as Medline, Embase etc.,"
      },
      {
        "title": "Signal detection and management",
        "description": "A safety signal is an information on any new serious adverse event/life threatening/ death event that has occurred which needs further investigation of the medicinal product. The safety signals can be detected from varied sources such as spontaneous reports, clinical studies and scientific literature. It is a collaborative responsibility of the regulatory authority and marketing authorization holders for detecting and managing safety signals. We have dedicated team to focus on the US requirements by extensive data mining across FDA AERS, clinical trials and other data sets. We also have expert team to manage the Eudravigilance database for suspected adverse reactions and signals as per the EU requirement. We also provide value added service by automated analysis capabilities for aggregate data review. We have a robust signaling and surveillance charter that allows the teams to tailor make the workflows and identify signal thresholds for various medicinal products."
      },
      {
        "title": "Company core data sheet update",
        "description": "The company core data sheet is an internal document owned by the marketing authorization holder. It provides the safety profile of the drug and also serves as the basis for prescribing a medication. This is also used for global advertising and promotional activities. The intention of developing a company core data sheet is to align the labelling information of the medicinal product across the globe and also to have the reference safety information for the assessment of the aggregate reports of the medicinal product. The company core data sheet also includes information on approved indications, doing requirements, method of administration, exceptional update on pregnancy and lactating mothers, packaging and storage requirements and also its limitations. At our company we have the required cross functional experts from medical affairs, drug safety, pharmacokinetics and pharmacodynamics (PKPD), toxicology, labeling group to play a collaborative role in updating the company core data sheet. We bring in diverse perspective, in depth data analysis and ensure the consistency of the information in the company core data sheet."
      },
      {
        "title": "SmPc update for generic molecules",
        "description": "Summary of product characterization is the basis of information for healthcare professionals on how to use the medicinal product safely and effectively. The package leaflet is designed in accordance to the SmPc. The guidelines on excipients in the label and packaging information leaflet of medicinal products for human use is applicable to SmPc. It acts as a objective document for a given generic molecule. Since the data is already available for the reference medicine, the study also involves the demonstration of same levels of active substance in the body as the reference medicine including the safety profile of the generic molecule. The medical professionals play a vital role in managing the integrity of each section of the SmPc document. The team focuses on providing detailed information to deal with the issues that is applicable to the core population using the generic molecule. The team efficiently manage the thorough analysis of the reference medicine while updating the SmPc for generic molecule."
      },
      {
        "title":"Health authority responses as required",
        "description":"Health authority response plays a critical role in safety profile of the medicinal product even during post marketing surveillance. It is responsible to manage the health security of the patients. In order to achieve this health authorities, conduct periodic check points at various levels of the life cycle of the clinical trial. The health authorities also ensure to conduct periodic check for safety profile of the drug as integral part of post marketing surveillance. It is important to provide all the relevant information in a structured manner to prove the safety and efficacy of the medicinal product. At company, we provide solution based approach to meet the requirements of the health authority within the assigned timelines. The team ensures enclosure of all relevant documentation to prove the integrity of the medicinal product. The team also shall propose corrective and preventive measures and measure the effectiveness of the solution proposed. The team shall conduct health check internally to ensure compliance."
      }
    ]
  },
  "clinical-trial-safety-operations":{
    "id" : 2,
    "title":"Clinical Trial Safety Operations",
    "content" : [
      "A clinical trial is a pivotal phase in the drug development process that provides safety information along with therapeutic exploration and confirmation. The main or primary objective of clinical trials is usually to establish the efficacy of an intervention, which drives sponsors to deploy all efforts on clinical operations while conforming to stringent processes implemented by health authorities. Thorough gathering and reporting of safety data during trials in line with regulatory requirements is often a challenge to most Sponsors. At OrciMed, we offer a broad spectrum of clinical trial safety services precisely crafted to achieve the Sponsor’s safety reporting requirements.", 
      "We are flexible enough to offer tailor made services to fit the Sponsor’s unanticipated critical problem or systematically manage the Sponsor’s complete Clinical Trial Safety Operations. Our expert team is proficient in the redaction of safety sections in Investigator Brochures and Dossiers, the preparation and submission of Development Safety Update Reports, the unblinding and reconciliation with safety database. We also have a dedicated team to provide their valuable input and function as an ethics committee by reviewing ethical or moral questions that may arise during patient care. At OrciMed, our expert team places emphasis on safety and compliance with regulatory requirements while managing protocols, configuring studies, processing clinical trial cases, managing Serious Adverse Events, analysis of similar events, updating Investigator Brochures and Investigator Notifications. Our multidisciplinary experts focus on designing robust clinical trial safety processes encompassing pharmacovigilance, epidemiology, and risk management. We partner with our Sponsor to evaluate and identify a customizable model that matches their specific requirements."],
    "image1": "./ctso1.jpg",
    "image2" : "./Clinical-Trial-Safety-OperationsPV.jpg",
    "Pharmacovigilance" :[
      {
        "title": "Protocol Review",
        "description": "A protocol not only details the study background along with reason and objectives it also defines the study design, methods, inclusion criteria and statistical considerations making it the most essential document used in clinical trials setting that describes the study conduct process. Hence, we emphasize on establishing uniform study conduct standards that enable our Sponsors to arrive at reasonable conclusions despite collating information from various study centers.  includes detailed validation of processes defined to confirm effectively study completion with available capabilities and resources. Our team of experts engage in scrupulous review of protocols to ensure key details regarding rational for study, participants, study design and data gathering while complying with protocol development guidelines."
      },
      {
        "title": "Study Configuration",
        "description": "Configuration of study is a pivotal activity in the new age electronic collection and management of clinical trial data both in clinical and safety databases. Study configurations aids in data compartment related to specific trail along with on demand retrieval that is accurate and reproducible. We are experts in creating studies by providing characteristics information relevant to the study using sensibly designed templates that captures data and transformations that are checked by validation. Our team of experts also help our Sponsors to create custom listings using filters and static references enabling our Sponsors to gain control and flexibility in designing and setting up clinical trials."
      },
      {
        "title": "Clinocal Trail Case Processing",
        "description": "The methodical data capture during clinical trial and planned follow-ups always ensure that the safety data generated during trials are comprehensive. However, consistently maintaining a robust process for reporting has always been a challenge. We are committed to safety in clinical trials support our Sponsor to maintain high standards of quality and compliance. Our expert team is proficient in case processing and management of cases from different studies like interventional, non-interventional and solicited. We ensure timely submissions to Health Authorities with our expertise in interpreting case reports for their seriousness, causality and expectedness. Our attention to data archival always helps our Sponsors during application for authorization, representations in master files and regulatory inspections."
      },
      {
        "title": "Unblinding of Cases",
        "description": "Unblinding is a unique decisive means often used to mitigate foreseen risks or unanticipated issues in a blinded trial where either investigator or subject or both are not aware of the treatment modality. Unblinding of cases involves removing the blind leading to identification of treatment and interventions received by the subject. We are experts in deploying stringent procedures and accurate documentation for unblinding during clinical trial to ensure compliance to regulatory requirements. Our expert team are proficient in interim analyses that help our Sponsors to evaluate efficacy disparity and safety profile among treatments. We also support our Sponsors to identify new scientific evidence and benefit-risk reassessment to help them end their clinical trials early, if required."
      },
      {
        "title": "Analysis of Similar Events",
        "description": "Some Health Authorities mandate submission of medical assessment of safety reports along with Analysis of Similar Events (AOSE) that provided meaningful insights and assessment of relevant events in conjunction with similar preceding reports and other relevant data. Our expert team develop analytical insights in safety during compilation of AOSE which is primarily required by United States Food and Drug Administration (USFDA) for Suspected Unexpected Serious Adverse Reactions (SUSAR) originating from interventional clinical trials sponsored by company and SUSAR originating from investigatory sponsored trials outside United States. The compilation of AOSE is also required by Swiss Medic for Suspected Unexpected Serious Adverse Reactions (SUSAR) originating from interventional clinical trials sponsored by company within Switzerland and serious unlabeled events in Individual case safety reports (ICSR) originating post marketing safety surveillance within Switzerland."
      },
      {
        "title": "Development Safety Update Report",
        "description": "Development Safety Update Report (DSUR) is a harmonized safety document used to assess relevant safety data and summarize the investigational products safety throughout clinical trial development phase. The current ICH E2F DSUR format is accepted by most Health Authorities in regulated market and submitted in the first authorization year of the clinical trial followed by annual reports until final study conclusion. This format enables ongoing risk evaluation and is mostly inspired by the Periodic Safety Update Report (PSUR) format used to detail post marketing drug safety summaries. We are well equipped to offer complete development of safety documents for our customer that includes all DSUR components as well as customized services for clinical review, sign-off, literature summary and analysis, and suggest company comments."
      },
      {
        "title": "Data Reconciliation between Clinical and Safety Database",
        "description": "Parallel recording of safety data in clinical and safety repositories like databases during the clinical trial process is an established process that requires reconciliation to confirm consistent and complete safety monitoring during clinical trial. Our expert team emphasize on careful early planning of this critical step that benefits our Sponsors by avoiding quality issues and unnecessary delays during the new drug approval phase. Our methodical approach and sound knowledge in managing safety data for both clinical and safety domains empower our multiple-disciplinary experts to cautiously decided what to be reconciled with whom on a timely manner. We can also customize our services to support ongoing reconciliation and modifications post initial severe adverse events reconciliation."
      },
      {
        "title": "Investigator’s Boucher Update",
        "description": "Investigator’s Brochure (IB) is a descriptive document for a pharmaceutical molecule undergoing investigation that provide Investigators and Sponsors with an insight of the summary of manufacturing process, methods of administration, dosing regimens, Serious Adverse Events, Adverse Events, procedures pertaining to safety monitoring, and all the clinical and nonclinical study results. An IB facilitates an Investigator to better comprehend the aim of the clinical trial. Our team of expert Medical Writers seamlessly ensure to deliver well written IB in a simple, balanced and concise format while keeping them non promotional and including an objective to enable an investigator to conclude to an unbiased risk imposed on subjects involved and potential benefit assessment. We are experts in performing the annual review of the IB and handling ad-hoc updates in compliance to Health Authority requirements throughout the clinical development phase."
      },
      {
        "title": "Investigator Notification",
        "description": "Critical safety information originating during clinical development phase should be immediately notified to all investigator. These primarily included findings signifying high risk or serious adverse reactions experienced by subjects especially if these are suspected and unexpected. Our experts devise customized communication protocols and maintain extensive contacts of participating investigators enabling our Sponsor to avoid logistical and operational challenges in notifying newly identified safety information. We can tailor our service to collaborate with Sponsor’s drug safety and clinical safety groups along with investigators or entirely manage Investigator Notification on behalf of our Sponsors proficiently."
      }
    ]
  },
  "medical-writing":{
    "id":3,
    "title":"Medical Writing",
    "content":["Medical writing is a distinct skill that requires the ability to create well-structured documents to present the information clearly and concisely. It is a well-known fact that all new drugs go through a progressively composite process of clinical trials and regulatory procedures that leads to approval of the drug for the market. Medical communication is the key to the success of the product on the market. Hence, there is a high demand for the articulation of medical information with standard regulatory compliant documents being available for medical professionals and translational researchers. The regulatory documents include clinical study protocols, clinical study reports, patient informed consent forms, investigator’s brochures, summary documents, etc.","At OrciMed, we have very well committed and experienced professionals to compile and develop high quality documents with a quick turnaround time. We bank on our distinguished exceptional writing team, which can help you compile and produce an assorted set of medical and scientific documents as per the requirements of different regulatory authorities. They quickly adapt to the given country’s regulatory compliance and provide a customized report to meet the client’s requirements. Our medical writing team has wide range of experience in various therapeutic segments and can provide their expert services at all levels of a clinical trial. We also provide extended documentation services for quality control, editing, and publishing of scientific documents. We ensure to provide accurate results to meet all the standards for the United States Food and Drug Administration (US FDA), European Medical Agency (EMA), as well as other regulatory authority guidelines, and also comply with the standards of the International Conference on Harmonization (ICH) guidelines."],
    "image1":"./Biostatistics-clinical-SAS.jpg",
    "image2":"./Medical-Writing-1.jpg",
    "Pharmacovigilance":[
      {"title":"Preparation of clinical study protocol and investigator brochure","description":"A clinical study protocol is a foundation of clinical trials. It is a document that describes the study objectives, design methods, assessment types, collection schedules, and statistical considerations for analyzing the data. The protocol outlines step for protecting subjects and procuring quality data. The document must be compliant with the applicable sections of the code of federal regulations (CFR) and the international conference on harmonization(ICH) guidelines. The investigator’s brochure is a document that describes the investigational product that is clinical stage of development. The document has to be compliant to the ICH E6 (R2) section 7 that provides the structure of the Investigator’s brochure document. Our expert team possess competencies in designing the clinical study protocol document. The team provides customized approach in designing the clinical study report depending on the country where the study shall be conducted. The team has mastered the opportunity to solidify the study design while providing the clear objectives and associated end points. The team has rich experience in drafting investigator’s brochure with cross functional expertise to include details about physical, chemical, pharmaceutical properties and formulation of the investigation drug. The team is noted for providing the drafted document with accuracy within the stipulated timelines."},
      {"title":"Preparation of informed consent forms, dairy cards and study assessment questionnaires","description":"This is an important foundation for the conduct of any clinical trial. It forms the basis to collect the safety and efficacy of the investigational product. Informed consent is a process that comprises of providing appropriate and obligatory information to the trail participants. Dairy cards are easy method of allowing the patients/trail subject to capture the initial response to the study drug that can be further evaluated by the investigator during the scheduled visits. The study assessment questionnaires stimulate in minimizing the bias and maximize the precision to the treatment. This gives a detailed vision to the realistic data revolving the investigational product. The proficient team at our organization help in advising the trail subject on the safety and efficacy of the investigational drug. The team clearly demonstrates the benefit risk assessment without any bias. The team is also multilingual which is an added advantage to connect to the trail subject to help them understand the clinical trial process. The team also provides support in analyzing the data points collected in dairy cards and study assessment questionnaires by providing the summary of the report to further analyze the safety and efficacy of the trial drug."},
      {"title":"Preparation of Medical monitoring plan, safety management plan and safety reporting processes","description":"Medical monitoring plan is an essential document that ensures the clinical integrity of the trail subjects and provide accountability to safety during the clinical trial process. The monitoring plan includes details on the systematic risk based approach, emphasize on the monitoring of critical information. It also includes details on schedule visit and the types of visits to be conducted. The Safety management plan provides a structured methodology to the clinical safety management. It helps the clinical trial sponsors to minimize the safety risks in trial subjects. The safety reporting process can vary from individual case safety reporting to comprehensive aggregate reporting depending on the requirement of the regulatory authority. Our team provides immaculate support in organizing and designing the medical monitoring plan and safety management plan as per the good clinical practices guidelines."},
      {"title":"Preparation of study procedure manuals, study updates and newsletters","description":"This is a manual of procedures more like a ready reckoner that details the conduct of the study, facilitates the consistency in protocol implementation and data collection across involved trail subjects and investigator’s site. It is a detailed document to operationalize the study procedure with a detailed description of each step of the study and execution process. During the life cycle of the study it also needs the updates to the study based on the information generated during the trial process. As an integral part of the clinical trial process the stakeholders take pride in publishing the newsletters to provide crucial information about all the activities related to the clinical trial. The skilled professional at our organization provide exceptional support in drafting the study procedure manuals to meet the study conduct requirements. The meticulous proficiency by the team members ensures to provide periodic updates to the study. We also have experts to work on the newsletters in a language that is read and understood by all to convey all the relevant details of the clinical trial to the relevant audience."},
      {"title":"Preparation of Clinical study reports","description":"A clinical study report provides a clinical and statistical depictions, presentations, and analysis of the complete study. This reports basically include a detailed description of the critical design features, planning, methods involved, individual patient details, details of analytical methods and conduct of the study. It is an important document to describe the study endpoints by detailing the data collection and the procedures involved in data analysis which confirms the achieved study end points. The document is designed in compliance to the ICH E3 guidelines. We provide adept solutions with cross functional subject matter experts who can support you to design the clinical study report as per the guidelines. The team shall ensure the completion of the clinical study document within 15 days of the assignment. We also ensure multiple levels of quality review by experts to ensure the accuracy of the documentation."},
      {"title":"Preparation of Abstracts, Manuscripts, case studies","description":"An abstract preparation is a concise presentation of the study which summarizes the major aspects of the study in a paragraph. It acts as a preview to understand the case study. The manuscripts are presented sequentially in four sections to include introduction, methods, results and discussion. The abstract is an overview of the manuscript of case study. Case studies are designed to gather information on actual trial subject encounters which is treated as real time data. They are the effective tool in demonstrating the clinical decision making of the study drug. They are commonly used in social, educational and clinical research. The case study involves qualitative methodology to describe the safety and efficacy of the study drug. The research scientist team provides immense support in preparation of precise abstracts, manuscripts and case studies for various therapeutic segments within the specified timelines."},
      {"title":"Collection and Analysis of key opinion leader’s inputs for study design","description":"It is imperative to consider and adapt the opinions of the leaders involved in the study design. The procedure involves to record all the details and recommendation made by the leader for a study design. Documentation and collection of the data play a key role to be considered during the study design. They lay the foundation to success of a clinical trial. Critical data points like study objective, environment of the study and the disease under investigation plays a vital role during the design in compliance to the regulatory guidelines. At our organization, we provide custom made solutions to meet the study objective and help in designing the study. We also provide support in collection and analysis of the key opinions provided by various leaders and provide a consolidated report in the clinical decision making of the study drug."}
    ]
  },
  "biostatistics-and-clinical-sas":{
    "id":4,
    "title":"Biostatistics and Clinical SAS Programming",
    "content":["Biostatistics is an important development and statistical method for obtaining appropriate clinical trial results and their interpretation. It is a competitive and an imperative process to procure and analyze the right outcomes from the clinical trials which provides a complete insight into the real data. It is an important discipline in clinical data analytics. The statistical analysis helps to uphold the integrity of a clinical trial. Biostatisticians are involved in every step of the clinical research process, including clinical trial design, protocol development, data management and monitoring, and data analysis. They serve as the bridge between data capture and reporting.","Statistical Analysis Software (SAS) is a biostatistical tool to manage and generate tables, listings, and graphs for clinical study reports. SAS plays a vital role in data analysis and also in the preparation of clinical study report. '<br/>' Our expert biostatisticians help in outlining the study end points, sample size calculation, interim analysis planning, and hypothesis of testing procedures. We partner with the clients through biostatistical programs that drive mutual success. We possess the industry standard proficiency to promote brilliant quality outcome of data analysis. We are known for providing flexible working models to meet customer requirements. We provide a secure analytics foundation and a scalable framework for clinical analysis and submission. Our SAS experts provide the market with a much-needed competitive edge, from remodeling trial designs to delivering leading platforms for data transparency. This methodology empowers the scalability, visualization and submission grade quality of the clinical trial teat results which can detect potential issues at a much faster pace."],
    "image1":"./8-1.jpg",
    "image2":"./Biostatistics-and-Clinical-SAS-programming.jpg",
    "Pharmacovigilance":[
      {"title":"Statistical input in protocol","description":"Statistical analysis plays a pivotal role in allowing clinical research professionals to draw rational and accurate inferences from the data collection and also contributes to make decisions. The statistical inputs in a protocol design helps to provide formal accounting for sources of variability in study subjects response to the treatment drug. Statistical inputs are characterized by launching an objective outline for conducting an investigation. The statistical programmers provide the theoretical data for upholding the scientific background. The programmers also support in designing the data production through experimentation and emphasis on the quantification corresponding to influence of the probability. The expert programmers also provide data solutions to estimate the systematic and random effects and add value to analyze the theoretical data using formal methods. The statistical inputs also involve information on defining the patient population, randomization and stratification with industry standard practices."},
      {"title":"Determination of primary and secondary endpoints","description":"The primary end point and secondary end points correspond to the objective of the clinical trial in progress. It is cognizant that both primary and secondary end points can be made up of several end points called a ‘family of end points’. Each of these end points play a vital role in ensuring the successive progression of the study towards the study objective. The trial end points can be continuous, binary or time to event end points. The statistical programmers bring their expertise in analyzing the data points using HAM-D symptom rating scale for a composite endpoint with multi component end points. We also expertise in implementing statistical methods like single-step and multi-step procedures such as Bonferroni method, Holm procedure, Hochberg procedure, Prospective Alpha Allocation Scheme, The Fixed- Sequence Method, The Fall back method and Gate Keeping strategies."},
      {"title":"Sample Size calculation","description":"Sample size is a part of the population that has been chosen in a clinical trial. The standard deviation of a sample can be used to approximate the standard deviation of a population. It is important to determine the optimal sample size for a clinical study assures an adequate influence to detect statistical significance. The calculation of an appropriate sample size is mainly influenced by certain factors like P value, Power, Effect, Alternative hypothesis. The study design has a major impact on the sample size. Experimental studies need lesser sample while the descriptive studies need hundreds of subject to give acceptable assurance interval for minor effects. The statisticians bring immaculate experience in analyzing the alpha level, standard deviation, minimum detectable difference, Power and withdrawals."},
      {"title":"Preparation of randomization plan","description":"Randomization plan is a critical feature in a clinical study design to control on the bias. Randomization plan design is set up in a such way that there is equality and no bias in the assignment of the treatment drug at each investigator’s site. It is also the process of assigning patients by chance to the groups that receive different treatments. In a modest clinical trial design, the investigational group receives the treatment drug and the control group receives the standard therapy. At the end of each of the study the clinical researchers compare both the groups to measure the effectiveness of the treatment. The randomization plan works on the principle of simple randomization, block randomization, stratified randomization and covariate adaptive randomization. The expert team perform the analysis according to intent –to- treat (ITT) and per protocol principle. The team has proficiency in also adapting to customized tools to prepare the randomization plan."},
      {"title":"Input in CRF and e-CRF design","description":"A case report form (CRF) is a specialized document in clinical trial. The principle of the case report form is protocol driven, robust in content and should be enabled to collect study specific data. It can be paper based CRF forms and also electronic CRF. The idea of the CRF from is to facilitate the collection of accurate data and reporting. It is imperative to have a strong collaboration between the statistical programmer and other key stakeholders which has a huge impact on the accurate designing of the CRF in a clinical study. The CRF is a link between the protocol, the database and statistical analysis plan. The expert trial statisticians and programmers provide their support in analysis by generating the collected data. Our trial statistician and trial programmers are heavily involved during the CRF finalization by providing their valuable inputs."},
      {"title":"Preparation of Statistical Analysis Plan","description":"The statistical analysis plan is a comprehensive document that contains a detailed technical description of the principal features of the analysis outlined in the protocol. It also includes wide-ranging procedures for executing the statistical analysis of the primary and secondary variables and other data. Although the Statistical analysis plan is an objective document, the document shall be reviewed in conjunction with the protocol. It is one of the crucial regulatory confidential document in the development of a clinical trial. The key aspects to be considered during the development of the statistical analysis plan are data monitoring, interim statistical analysis, integrated statistical analysis plan and statistical analysis plan for the clinical study. The statistical methodology includes data points like hypothesis of the clinical study , primary and secondary end points, develop a strategy to reduce the bias, sample size collection and to define statistical methods for the clinical trial analysis."},
      {"title":"Statistical and SAS programming","description":"Statistical programming helps in outlining the study end points, sample size calculation, interim analysis planning and hypothesis of testing procedures. The statistical analysis helps to uphold the integrity of a clinical trial. Biostatisticians are involved in every step of the clinical research including clinical trial design, protocol development, data management and monitoring, data analysis. The role of the statistical programmers is to use their superior technical and programming skills to allow the clinical trial statisticians to perform the statistical analysis more efficiently. SAS experts provide market needed competitive edge from remodeling trial designs to delivering leading platforms for data transparency. They work on data sets to meet the study requirements as per the regulatory authority guidelines."},
      {"title":"Preparation of statistical tables, graphs and listings","description":"As an integral part of the regulatory reporting requirements, it is imperative to generate tables, graphs and listings for reporting purpose. The clinical trial data is thoroughly analyzed by expert team members and presented as tables, graphs and listings in clinical trial reports. They play a unique role since it acts as a one stop destination to understand and analyze any queries from regulatory authorities. The listings basically have all the information that one needs to know involved in a clinical trial. The significance of SAS in the pharma programming arena by producing tables, graphs and listings by mock annotations. The derived data sets through SAS is used as a base to write the code to produce tables and listings. The step wise process followed by SAS team experts work on the protocol and CRF, statistical analysis plan, mock databases, annotated CRF, annotated mocks, derived datasets, programming rules which leads to the generation of perfect tables and listings that are required for further analysis at any stage of the life cycle of the study drug."},
      {"title":"Preparation of statistical reports","description":"The statistical reports provide an overview to the complete clinical trial process. This report describes statistical methods with accurate details to access the source data to verify the reported results. It also enables to quantify the findings and present them with appropriate indicators to measure the errors. The statistical reports also emphasis on the blinding observations and provide detailed analysis of the treatment complication in the trial subjects. The statistical reports also highlight on the statistical measures and methods followed during the process of the clinical trial. The experienced biostatistician provides substantial help in preparation and analyzing the reports for further interpretation of the safety and efficacy of the trial drug. The statistical reports also focus on the actual outcomes such as means and standard deviations at derived intervals."}
    ]
  },
  "regulatory-affairs":{
    "id":5,
    "title":"Regulatory Affairs",
    "content":["Health Authorities have meticulously devised complex rules and regulations for the development of pharmaceutical products and regulating their commercialization globally. Regulatory Affairs team liaises between Health Authorities and Pharmaceutical Organizations to ensure all obligatory requirements are successfully accomplished on time and compliance with regulations throughout the life cycle of the drug. Pharmaceutical Organizations are constantly challenged by the daunting and mammoth effort required for scrutinizing, deciphering, and tracking key regulations and steps related to the stringent drug approval process.","We are a global leader in the Regulatory space and excel in bridging Global Health Authorities and Pharmaceutical Organizations. We are well equipped to deliver strategic and multidisciplinary Regulatory Affairs services through drug development, registration, commercialization, and managing regulatory compliance. We enable our customers to successfully launch their products globally despite complex and demanding regulatory requirements with our domain expertise and meticulous tracking. Our expert team comprises of specialists who can navigate products through the complete regulatory approval process, along with devising specific strategies for agency interface, managing regulatory strategy, GAP analysis, product classification, authoring dossiers, the development and update of labels and common technical documents, submission preparation, publishing, regulatory intelligence, and Quality Assurance for various categories of products. We understand the changing needs of a Marketing Authorization Holder and act as an extension of its team to ensure post-authorization requirements regarding quality and safety are achieved. Our regulatory operations experts are specifically skilled to optimize renewals, variations, and other lifecycle management activities. Our multi-disciplinary expert team can also customize specific services related to Clinical Trial registration and safety reporting to fit client requirements. The strong scientific background of our experts coupled with up-to-date regulatory expertise enable our clientele to recognize efficient regulatory strategies, monitor the approval process and succeed with marketing authorization."],
    "image1":"./Medical-Writing.jpg",
    "image2":"./Regulatory-Affairs.jpg",
    "Pharmacovigilance":[
      {"title":"Preparation and Submission of Regulatory Dossiers for Clinical Trial Approvals and Marketing Authorizations","description":"Marketing Authorization / license / approval (investigational new drug approval and new drug approval) is a mandatory requirement for any product before commercialization and used in Humans. The content and format of various regulatory agencies are specific to territories makes compiling a dossier very pain staking. We can customize our services by providing both complete and partial dossier preparation with high levels of quality and compliance. We guarantee on time submissions to enable our Sponsor achieve their Approval / Authorization timelines. We are up to date with relevant regulatory requirements and efficient in managing physical dossier submission required by specific territories. Our experts are proficient in electronic dossiers management and empower our Sponsors to achieve compliance to rules and regulations specified by relevant Health Authorities."},
      {"title":"Liaising with Regulators for Submission and Approvals","description":"Seamless product commercialization, prompt responses on approvals and submissions can be effortlessly achieved by timely and effective communication with Regulators. Pre-submission interactions and meetings with Health Authorities are vital occasions for understanding the Regulator’s requirements in detail and clarify the applicant’s strategy for specific submissions. We can act as an extension of our Sponsor for various types of meetings and interactions thereby navigating the product throughout the development cycle towards successful Regulatory approval. We are experts in preparing meeting materials, managing queries and support our Sponsors with guidance and expert advice on deficiencies noted during the life cycle of the product submission and approval."},
      {"title":"Review of Technical Dossiers","description":"Drug master file is one of the most integral part of any registration application or Marketing Authorization and contains chemical information, manufacturing aspects as well as information on the control of the active pharmaceutical ingredient. Our robust interdisciplinary experts help review Sponsor’s technical documents compiled in any format for its submission to regulatory authorities across the globe. We deploy a methodical and pragmatic review process that enable our Sponsor to present Regulatory Agencies with appropriate information to successfully conclude on whether the benefits outweigh the risks and establish the safety and efficacy of the investigational product for seamless navigation of product through the approval process."},
      {"title":"Presentation of Protocols to Regulatory Expert Committees (NDAC, SEC and MDAC in Case of DCGI)","description":"The protocols undergo stringent review process and are required to be presented to expert committees appoint by regulators in an attempt to reinforce the scientific review in approval of drugs and devices. Along with the application, the safety and efficacy data for the medicinal product should be presented by the Sponsors to the committee for decision on approval of the product. We understand regulators approach towards scientific evaluation during approval process and can help us Sponsors by providing appropriate assist in preparing the presentations and advise on its delivery along with technical reviews and query responses for combinations products, various formulation and mixed dosage forms."},
      {"title":"Registration of Clinical Trials in National Registries","description":"Clinical Trial Registries are usually collaborative libraries that publicly present information regarding clinical trials in an attempt to link patients to research. Advance entry of clinical trials in national agencies is a regulatory requirement that requires tedious preparation where our experts can efficiently support both our Sponsors and Investigators with our robust system for both interventional and observations studies. We can partner with our Sponsor and take complete responsibility of registering, periodic review and update with high standards of quality."},
      {"title":"Safety Reporting: SAE, Annual Reports and Safety Reports","description":"Most Health Authorities have mandated submissions of safety data to be made electronic along with other essential regulatory submission and approval documents. Our experts are well versed with leading publishing tools and safety submission requirements of global regulators. We strive to be compliant to every Health Authority requirement and employ stringent quality check mechanism to ensure the reporting is complete and meet the electronic reporting requirements of each Health Authorities. We support safety operation of our Sponsor with extensive tracking mechanism and notifications to ensure reports like Periodic Safety Update Report, Periodic Benefit Risk Evaluation Report, Periodic Adverse Drug Experience Reaction, Annual Summary Report are completed and submitted to Regulators within defined timelines."}
    ]
  },
  "data-management":{
    "id":6,
    "title":"Data Management",
    "content":["Data Management is the central requirement for enabling subsequent processes with the intent of providing structured data consistently for analysis and reporting. It is a critical phase in clinical research that leads to the generation of high-quality, reliable, and statistically proven data from clinical trials. Adapting innovative data management methodologies helps to ensure data integrity, quality, and accountability in our process. At OrciMed, we have set standards and put governance mechanisms in place to ensure the quality of data with a reduced turnaround time. We provide tailor made solutions to various procedures in Clinical data management including Case Report Form (CRF) designing.","CRF annotation, database designing, data entry, data validation, discrepancy management, medical coding, data extraction, and database locking. The expert team at our organization proactively recognize the pain points, highlights it to the customers and provides custom-built approach to ensure quality data submission to regulatory authorities. Our goal is to provide high-quality data with minimal or no missing data, most significantly high-quality data that possess subjectively acceptable level of variation which should not affect the conclusion of the study on statistical analysis. We provide comprehensive data management solutions with well-designed outsourcing models and experience in all therapeutic areas and all phases of clinical trials. Our strategic solution is to focus on data flow for real time data cleaning. We comply with 21 CFR part 11 regulations and also have acquired proficiency in various CDM tools like ORACLE CLINICAL, CLINTRIAL, MACRO, RAVE including open-source tools like OpenClinica, OpenCDMS, TrialDB and PhOSCo. We possess team members with different roles and responsibilities who perform their roles effectively and efficiently."],
    "image1":"./Data-Management.jpg",
    "image2":"./Data-Management-1.jpg",
    "Pharmacovigilance":[
      {"title":"Paper CRF /eCRF development and database design","description":"A case report form (CRF) is a specialized document in clinical trial. The principle of the case report form is protocol driven, robust in content and should be enabled to collect study specific data. It can be paper based CRF forms and also electronic CRF. The idea of the CRF from is to facilitate the collection of accurate data and reporting. It is imperative to have a strong collaboration between the statistical programmer and other key stakeholders which has a huge impact on the accurate designing of the CRF in a clinical study. The CRF is a link between the protocol, the database and statistical analysis plan. Database design plays a vital role in clinical research. It is a structured form that has a defined rows and columns that allows to capture all the data in the CRF. The data base designing has to be compliant to 21 CFR part 11. We possess extremely eminent professionals who can support in paper CRF/eCRF designing. We serve as one stop store for any customized database designing requirements."},
      {"title":"Data Management Plan","description":"It is important for any clinical trial study to possess a data management plan. It is a written document that describes the plan for collection and management of data throughout the lifecycle of a clinical trial. The data management also emphasis on the storage of the data and data protection provisions. It is also essential to focus on detail information on data archival process. It is important to review and finalize the document for the clinical trial study. The data management plan needs to be designed in such a way that it ensures the availability and accessibility of the trial even after the project completion. We have developed expertise over the years in designing and development of the data management plan including all the parameters to enable a comprehensive document detailing the end to end process."},
      {"title":"Data entry, verification and validation","description":"Clinical data management is a critical phase in clinical research that leads to generation of high quality, consistent and statistically heavy data from clinical trial study. The data entry is the key to accumulate and all the information from CFR/eCRF or any other sources as designated in the study into the approved database. Our experts follow robust practice in performing the accurate data entry. We also provide two level quality check as a part of the process to ensure data accuracy. The primary objective of the clinical data management process is to provide high quality data ensuring the minimal errors and no data misses. Data validation is the heart of the process in clinical data management process that ensures by testing the validity of the data in accordance to the protocol specifications. The expert teams also perform edit checks to ensure discrepancy management and provide validated data."},
      {"title":"Double Data entry (paper CRF)","description":"Double data entry is the state of the art in clinical trials where the data is entered twice to ensure the integrity of the data entered. It is a process where the data is first entered in paper CRF and then the data is entered into the prescribed database. The efficient clinical data managers at our company play a key role in ensuring the data entry process. It is believed to be more effective in reducing data entry errors. Though it is considered as a conventional approach to data entry in clinical data management, some companies prefer to capture the data through the double data entry process and we play an intermediate role in providing our expert support in performing double data entry utilizing the best practices to provide more accurate data."},
      {"title":"Coding in MedDRA and WHO DD","description":"Medical coding is performed to categorize the reported medical terms appropriately. It is important activity in data management to enhance the analyzation of verbatim. The expert medical coding professionals at our organization have rich experience in MedDRA (Medical Dictionary for regulatory activities) and WHO DD (World Health Organization Drug Dictionary) The experts ensure that the reported verbatim is coded appropriately as per the CRF/eCRF. MedDRA is used to code all the medical terminologies generated during all the phases of the clinical trial, therapeutic indications, signs and symptoms, disease diagnosis. It also plays a vital role in coding quantitative results of the investigations, surgical procedures, medical and family history. WHO DD is most comprehensive dictionary which has medicinal product information. We have certified team members who can provide holistic approach to coding."},
      {"title":"Query resolution and data base locks","description":"Query resolution is an elaborated process to ensure the data discrepancies are addressed. The data discrepancies can arise at various levels of the data management process and as a part of the validation process it is the responsibility of the data managers to raise the queries to the sponsor or sponsor representative or the investigator to resolve the error or inconsistency discovered during data review. We also provide solution in automating the structured query email which allows the data managers to edit the email as required and send it to appropriate stake holders for query resolution. This fastens the process of query and with automation has a process to track all the queries raised and help in addressing the discrepancies. The database lock is an action taken to prevent any further changes to the database after query resolution and determine that the study is ready for further analysis."},
      {"title":"Design Safety database","description":"Safety databases are designed to collect study information to accurately assess the safety of the medicinal product. It also facilitates the reporting of individual and aggregate safety data to the regulatory authorities and any stake holders. It acts as a key source of information for any safety signals and also a repository to evaluate the benefit risk of the study drug. It is important to consider global compliance while designing a safety database. It is important to consider parameters compromising of common code base, periodic reporting, E2B exchange scientific querying and submissions. Decision making on size of the database during the database designing is important as safety databases for medicinal product intended to use in life threatening disease especially when there is no alternative treatment can be smaller compared to safety database used for treating that are not life threatening. We provide customized support in designing the safety database on the need basis of the customers."},
      {"title":"SAE reconciliation","description":"Serious Adverse event data reconciliation is the comparison of key safety data variables between clinical data management system and sponsor PV. Reconciliation is performed to ensure that events residing in both the systems are consistent. The data managers are responsible for performing reconciliation on a periodic basis. The objective is to reconcile all the discrepancies before the final data lock of the clinical trial. Our expert team provide solution with automation to review reports from the data management system and the line listings from safety database. It presents the highlighted discrepancies for further validation bt the data managers to ensure consistency in the serious adverse events. This enhances to reduce the effort estimate to perform the SAE reconciliation process and enables the data consistency during the clinical trial process."},
      {"title":"Electronic data integration","description":"It is a computerized system designed to collect clinical data in electronic format. The EDC system replaces the traditional paper based data collection methodology to streamline the data collection process. The EDC solutions are widely accepted and adopted by pharma and CROs to benefit in particular for the late phases clinical studies and also in post marketing surveillance. The current trend as recommended by the US FDA is to suggest methods of capturing clinical trial data electronically from the beginning of the clinical trial and moving to the cloud. Our experts also promote solutions to transform the structured ad unstructured data from different sources into a trusted system. We provide data integration tools and solutions with promising data accuracy."},
      {"title":"Customized data listings","description":"Data listings are the reports generated on the raw datasets. They play an important role in the data validation. The main objective of the data listings is to pull out the discrepancies in the raw data. It is well known fact that every study is different with its own objective and maintaining and validating the data quality is an important step in the data management platform. The data validation specification describes the number of the listings, purpose, the fields to be presented in the outcome, specific raw datasets to be used, the discrepancies that need to be flagged. The listings can be customized to the study requirement and the skilled professionals at our organization provides a thorough solution to determine the customization of the data listings as the clinical study requirement."}
    ]
  },
  "health-economics-and-outcomes-research":{
    "id":7,
    "title":"Health Economics and Outcomes Research",
    "content":["A multidisciplinary approach to design, execute, and analyze new interventions is required for generating relevant evidence for different stakeholders, reimbursement agencies, and health authorities. Health Economics and Outcomes Research (HEOR) is often foreseen as a complex process due to factors like different approaches to healthcare delivery and the varying cost of healthcare resources in various states. At OrciMed, we emphasize the economic impact of treatments, diseases, and conditions, along with the direct and indirect costs due to medical expenditures and costs associated with disability and loss of work respectively.",
  "Our expertise includes comprehensive literature reviews, clinical evidence generation, and various methodologies for economic modelling that draw on diverse data sources from global markets. Our experts are qualified professionals in health policy, pharmacy, and medicine with distinguished expertise in economics, psychometrics, epidemiology, biostatistics, and econometrics. Our HEOR team can also supports customers through services including management of economic endpoints in clinical trials, treatment pattern analyses, portfolio planning, trial/market simulation modeling, pricing and market access research, Patient Reported Outcome (PRO) studies, global cost-effectiveness models, and value dossiers. Our expert team can develop suitable solutions based on customer requirement that can be as simple as a cost calculator to assess treatment costs and costs of adverse events to various models to evaluate economic implications and compare customer products with comparators."],
    "image1":"./6.jpg",
    "image2":"./Health-Economics-and-Outcomes-Research.jpg",
    "Pharmacovigilance":[
      {"title":"Systemic Literature Reviews / Targeted Literature Reviews & Clinical Evidence Generations",
      "description":"While Systematic Literature Reviews (SLRs) are standard studies designed to addresses specific research questions by collecting and summarizing information from existing clinical research, Targeted Literature Reviews (TRAs) are non-systematic literature review that focuses on specific topics and are more informative. We adhere to guidelines defined by authorities and follow a pragmatic and technical methodology to deliver client specific requirements that are reproducible and reliable. Our experts generating real-world evidence, real-world evidence, Patient Reported Outcomes (PROs) and Patient reported outcome measures (PROMs) along with electronic format migration, translation and licensing."},
      {"title":"Systemic Literature Reviews / Targeted Literature Reviews Epidemiology","description":"Epidemiology focuses on understand the causes and incidence of disease. Prevalence and incidence are measures of disease frequency used to resolve varying research problems. While incidence indicate number new cases, frequency indicates number of existing cases. We expertise in systemic literature reviews (SLR) and targeted literature reviews (TLR) help our customers effectively measure disease frequency, health outcomes over time and population groups to derive effective treatment, prevention and care. We are experts in prevalence, the risk, and the incidence rate measures and advise our customers on selection of most suitable measures specific to their study populations."},
      {"title":"SLR Health-Related Quality of Life (HRQOL)","description":"Health Related Quality of Life (HRQOL) as an outcome plays a pivotal role in assessing public health rather than the traditional measures and help in devising better interventions to avoid serious outcomes and progress their situation. Our experts can deliver high quality Systematic Literature Research that enables need based analysis for policies, identify interventions via strategic planning and monitor its effectiveness. Our process is configured based on thorough understand of guidelines from Preferred Reporting Items for Systematic Reviews and Meta Analyses (PRISMA) and Institute of Medicine enabling our clients to effectively determine economic burden of illness and gain insights in HRQOL and risk factor relationship. We can partner with our client to develop and validate unique HRQOL measure for their specific patient population and health outcome."},
      {"title":"SLR/TLR Economic modelling","description":"Our experts develop insights with their proficiency in various economic models like Partitioned survival analysis, Markov Models, discrete event simulation (DES), decision trees along with Multiple Criteria Decision Analysis (MCDA) that help our client attain their HEOR goals. Our budget impact models (BIM) development process ensures effortlessly budget impact analysis during introduce new products introduction. Our expertise in cost analysis has ensured our processed out to be detailed with ready data for improvement resource distribution and planning resulting in quick and enhance decision making. We provide expert guidance with a strong background of health technology assessment (HTA) agency requirements for HTA submissions and method selection for economic evaluation like cost-benefit analysis, cost-utility analysis, cost-minimization analysis and cost-effective analysis (CA) and incremental CA ratio (ICER)."}
    ]
  },
  "additional-pharmacovigilance":{
    "id":8,
    "title":"Additional Pharmacovigilance",
    "content":["Pharmacovigilance is a critical function in the life cycle of the drug that focuses on patient safety and quality of life. While the principles of drug safety remain the same globally, the requirements of Regulatory Authorities are very specific and have yet to be completely harmonized. Additionally, pharmaceutical organizations are challenged by the ever-changing regulatory requirements and unique needs of commercial partners. At OrciMed, we focus on enabling our customers to deliver quality pharmaceuticals and medical devices with our expertise in risk minimization and maximizing patient safety.","Our alignment to Good Pharmacovigilance Practice benefits our customers by establishing confidence in Health Care Professionals and Patients across global markets. Our comprehensive pharmacovigilance services are focused on achieving customer satisfaction while prioritizing patient safety throughout drug development and commercialization. OrciMed can customize solutions to suit specific drug safety requirements and rapidly scale up for complete pharmacovigilance delivery. At OrciMed, we can extend our support to host your safety data in compliance with various privacy laws and successfully regulate the exchange of your pharmacovigilance data. Our expert team provides a range of distinct solutions for the maintenance of ^ system master file, product dictionary and regulatory downloads that cater to specific requirements. Our multi-disciplinary team integrates expertise in various domains to support our customers in audits, inspections, literature reviews, and translation services. Our continuous learning process and up to the minute regulatory insight facilitate constant monitoring of Key Performance Indicators and enable our team of experts to achieve high standards of quality and regulatory compliance."],
    "image1":"./7.png",
    "image2":"./Other-PV-Safety.jpg",
    "Pharmacovigilance":[
      {"title":"Data entry and Maintenance of product details in Medical Product Dictionary (XEVMPD / IDMP)","description":"In line with Article 57(2) regulation of the European Union, Marketing Authorization Holders (MAH) are required to maintain a repository of its medicinal and investigational products and submit product details via electronic message to European Medicines Agency (EMA). Our expert team is proficient in using the data entry tool developed by EMA for small and medium sized organizations. We are also competent in handling leading industry tools along with customization and development of tool for submission of product details via electronic format. Our experts can efficiently handle the transition from eXtended Eudravigilance Medicinal Product Dictionary to Identification of Medicinal Products (IDMP) to relieve Sponsors from the stress of changing regulations and adaptation of IDMP by regulatory agencies."},
      {"title":"EudraVigilance Downloads","description":"European Medicines Agency (EMA) has extended controlled access to various stakeholders to its safety data repository to enable better safety monitoring, signal detection and its evaluation. Marketing Authorization Holders (MAH) are required by regulation to include the data archived in EudraVigilance database on a regular basis. We are expert at devising a pragmatic filters and systematic download schedules that will assist MAH to effectively manage workload and reduce costs while maintaining compliance to regulations. We also offer tailored services to across the spectrum of process of EudraVigilance downloads. Our experts are also proficient in accessing and management downloads from other Health Authorities like Health Canada and United States Food and Drug Administration."},
      {"title":"Audit and Inspection Support","description":"Pharmacovigilance processes have become complex and demanding due to changing regulatory framework which are monitored with audits and inspections to impact on quality and compliance of safety data and its systems. With strong domain knowledge in Pharmacovigilance (PV) and good knowledge of Quality Management System (QMS) our experts can extend support our customer during audits to minimize their risk. We also offer auditing as a service with focus on follow-ups and timely coordination for including regulatory audits, partner audits and affiliate audit. Our audit readiness program will help our customers to become more confident in their PV process and maintain highest standards of quality and compliance to regulatory requirements."},
      {"title":"Setting up of Comprehensive Pharmacovigilance System","description":"Pharmacovigilance (PV) systems are a set of complex operations that impeccably function together to minimize risk and maximize patient safety. Diverse and every updating regulation has made it very difficult for pharmaceutical organizations develop and operate a PV system. With Good Pharmacovigilance Practice as backbone of our processes we offer comprehensive pharmacovigilance services that cater to pharmaceutical organizations of all proportions. We have proven capabilities in the broad spectrum of PV services and good understanding of global and local drug safety requirements that empowers us rapidly scale up for complete pharmacovigilance delivery and set new industry benchmarks in quality and compliance."},
      {"title":"Qualified Person for Pharmacovigilance (QPPV Services)","description":"Qualified Person for Pharmacovigilance (QPPV) is critical resource in establishment and smooth functioning Pharmacovigilance (PV) system. Marketing Authorization Holder (MAH) are obliged under the European Union (EU) legal framework to appoint a QPPV for initiation and oversight of PV activities. Many countries need a local or regional responsible person for pharmacovigilance at country level to comply with local regulations. Not only do we provide expert services for EU QPPV and local QPPV requirements that guarantee our clients are equipped with the right resources to be compliant with regulations we also offer tailored services to understand which countries require local QPPV and manage cost-effective recruitment."},
      {"title":"Pharmacovigilance System Master File (PSMF) authoring and updates","description":"Pharmacovigilance System Master File (PSMF) is essential document required to be developed and maintained by applicants and Marketing Authorization Holders (MAH) that describes the complete operating structure of its pharmacovigilance (PV) system. Our experts have sound knowledge of Good Pharmacovigilance (GVP) Modules II and proficient in developing structure and content for PSMF that comply with regulations. Our detail-oriented processes enable us to meticulously included all details of the PV systems in a clear, concise and unambiguous manner along with tracking periodic changes and updating the PSMF and its Annexures promptly. Our experts are proficient in both traditional and new tools (ePSMF) for authoring, updating and maintaining of PSMF."},
      {"title":"Safety Data Exchange Agreements (SDEA) Management","description":"Safety Data Exchange Agreements (SDEA) are usually contracts between licensing / commercial partners and Marketing Authorization Holders (MAH) that details the handling and exchange of safety information to ensure either party comply with legal obligations for safety handling and submissions. We are experts in development of SDEA templates that ensures all factors affecting safety data exchange are effortlessly captured to comply with regulations. We can support our client with drafting and reviewing of SDEAs along with negotiating with partners, reconciliation of exchanged safety data, tracking of effective documents and revision. We also provide critical insights in identifying gaps and interdependencies in PV system that affect SDEA and PV process compliance."},
      {"title":"Provision of Safety Database","description":"Safety database is an electronic repository that enables collection, processing and submission of individual Case Safety Reports (ICSR) along with facilitating analysis for aggregate, signal and other safety reports. It is a core component of PV System that should fulfill regulatory validation standards along with being periodically updated to comply with changing regulations and updating dictionaries. With vast experience and expertise, we can help our customer choose the precise Safety Database and validation protocols for their requirements that will reduce implementation and maintenance costs. We also advise on interoperability, hosting models and compatibility within existing setup. We are experts in planning, executing, review and release of periodic dictionary upgrades along with offering hosting as a service."},
      {"title":"Safety Data Migration Assistance","description":"Acquisitions, divestment, technology upgrade and organizational change mandate migration of data from all safety domains. Our experts carefully analyze the source and target to establish the prerequisites and requirements forming a mapping to enable seamless safety data migration. Our prudent validations checks enable us to advise our customers on the right strategy, tools and techniques to meet regulatory compliance, achieve best quality, data integrity and security. We can also assist in conducting migration of safety data for Individual Case Safety Reports (ICSR) from various sources like databases, listings and documents along with identification and migrations of aggregate reports, signal reports, medicinal product details and other safety reports."},
      {"title":"Literature translation and full text articles","description":"Medical and scientific literature is a vital source of safety data for identifying risk and maintaining safety profile of the drug. Varying regulatory requirement for literature surveillance baffle pharmaceutical organizations and put them at risk of noncompliance. Within the array of our literature services, we support of client with translation of literature from foreign languages within short during our time with high level of accuracy. We handle procurement of full text articles to meet our customers literature surveillance requirements for Individual Case Safety Reports (ICSR), aggregate reports, signal reports and other safety reports. We offer expert advice in understating local literature requirement and extend our support in local literature search and procurement of local literature articles."}
    ]
  }
}