{
  "savita-ravindra-gupta":{
    "name":"Savita Ravindra Gupta",
    "role":"Associate Director - QA",
    "profilePic":"/savitha.png",
    "headings":["Global Expertise in Pharmaceutical Quality","Comprehensive Knowledge Across Multiple Domains","Driving Quality and Compliance at OrciMed","Certifications and Leadership Development"],
      "info":["With over 16 years of global experience in the Pharma, Life Science, and Clinical Service sectors, Savita has developed deep expertise in Quality Assurance. She has worked with esteemed organizations like ADVANZ Pharma, Cognizant, and Johnson & Johnson, specializing in audits, inspections, and regulatory compliance.","Savita’s expertise spans pharmaceutical quality processes, clinical research, pharmacovigilance, data management, regulatory affairs, and biostatistics. She is well-versed in global regulatory requirements, including those of the EMA, US-FDA, MHRA, and Health Canada.","As the Quality Head at OrciMed, Savita is responsible for implementing quality and compliance strategies that drive efficiency and meet regulatory standards, ensuring OrciMed’s operations and client solutions are of the highest quality.","Savita holds a BSc in Life Sciences and Biochemistry from Mumbai University and is an ISO 9001:2015 Lead Auditor and ISO 13485:2016 Lead Auditor (Medical Device Certification). Additionally, she has completed advanced training in pharmacovigilance auditing and leadership."]
  },
  "mr-suman-maarisetty":{
    "name":"Mr. Suman Maarisetty",
    "role":"Chief Executive Officer",
    "profilePic":"/suman.png",
    "headings":["Driving Growth and Transformation","Entrepreneurial Excellence: Co-Founder of Vigi MedSafe","Global Experience and Regulatory Insight","Scientific Acumen Meets Business Strategy","A Respected Leader and Visionary"],
    "info":["Suman brings over 15 years of exceptional leadership and proven performance in the pharmaceutical and life sciences industry. As the Chief Executive Officer of OrciMed Life Sciences, he is spearheading the company’s strategic transformation and elevating it to its next phase of growth.","Prior to joining OrciMed, Suman co-founded Vigi MedSafe, a niche pharmacovigilance service provider. With his relentless pursuit of operational excellence, he built an end-to-end service delivery and operations framework within the first year. Under his leadership, the company transitioned from a humble beginning in 2013 to a globally recognized clinical research organization by 2019. Vigi MedSafe became known for its high-quality execution, deep scientific capabilities, and strong customer partnerships—leading to its successful acquisition by PPD Inc.","Suman's early career at the Medicines and Healthcare products Regulatory Agency (MHRA) in the UK provided him with a strong regulatory foundation. He subsequently held pivotal roles at leading pharmaceutical organizations including PPD (a part of Thermo Fisher Scientific), Novartis, and Eli Lilly. Across these roles, he contributed to global regulatory initiatives, clinical operations, and strategic business functions.","Combining deep scientific expertise with business foresight, Suman possesses complete end-to-end operational visibility—from audit preparedness and regulatory compliance to strategic customer engagement. His ability to integrate quality, innovation, and client needs into every engagement ensures consistent delivery excellence.","Suman is known for his visionary leadership style, inclusive stakeholder engagement, and ability to build high-performing teams. His management strategies, forward-thinking approach, and dedication to quality have earned him the trust and admiration of both clients and employees alike."]
  },
  "dave-agrella":{
    "name":"Dave Agrella",
    "role":"Chief Revenue Officer",
    "profilePic":"/Dave.png",
    "headings":["A Veteran in Clinical Research and Commercial Strategy","Leadership Legacy at PPD/Thermo Fisher","Client-Centric Focus and Strategic Alignment","Industry Thought Leader in Outsourcing and Innovation","Personal Background"],
    "info":["Dave brings over three decades of rich and diverse experience in clinical trials, marketed products, and technology. As the Chief Revenue Officer at OrciMed Life Sciences, Dave is responsible for driving strategic revenue growth while ensuring clients receive exceptional service value and quality.","Prior to joining OrciMed, Dave spent 20 impactful years at PPD, now part of Thermo Fisher Scientific. Throughout his tenure, he held several leadership roles spanning laboratory operations, clinical operations, and technology enablement. Most notably, Dave led the Functional Service Provider (FSP) and Government business units, where he was instrumental in achieving substantial organizational growth and operational excellence.","Dave is known for his unwavering commitment to transparency and client satisfaction. He prioritizes understanding each client’s strategic objectives and aligning OrciMed’s service delivery to meet those goals effectively. His approach ensures that partnerships are both collaborative and outcome-driven.","With a unique perspective on today’s clinical market dynamics, Dave is widely regarded as an industry thought leader in outsourcing strategies, operational frameworks, and technology implementations. His insights help clients navigate complex clinical environments with agility and informed decision-making.","Dave is based in Wilmington, North Carolina, where he lives with his wife and three children. His balanced approach to leadership—anchored in family values, transparency, and performance—resonates across teams and clients alike."]
  },
  "dr-raza-mohammad":{
    "name":"Dr. Raza Mohammad",
    "role":"Chief Scientific Officer",
    "profilePic":"/Raza.png",
    "headings":["Expertise Rooted in Medicine and Pharmacology","Leadership Across the Drug Safety Spectrum","Entrepreneurial Foundation and Medical Operations Leadership","Comprehensive Scientific and Regulatory Expertise","People-First Leadership and Client-Centric Delivery"],
    "info":["Dr. Raza is a seasoned physician with specialized qualifications in pharmacology and diabetology. With a decade of clinical practice and nearly 15 years of experience in pharmacovigilance, he brings a rare blend of scientific depth and operational insight to OrciMed Life Sciences.","Dr. Raza’s experience spans the entire pharmacovigilance lifecycle—from early-phase clinical development to post-marketing surveillance and generic product safety. He has worked with both large multinational CROs and big pharmaceutical companies, gaining extensive exposure to global regulatory environments and diverse therapeutic areas.","Prior to joining OrciMed, Dr. Raza co-founded a pharmacovigilance company where he led the medical division. Under his leadership, the team of physicians expanded rapidly, establishing a reputation for quality and scientific rigor. His leadership helped build a scalable and robust medical review capability that supported global safety deliverables.","Recognized as a subject matter expert, Dr. Raza has led initiatives in medical case reviews, aggregate safety reporting, literature surveillance, signal detection, risk management planning, and core safety document updates. His proficiency also extends to regulatory response drafting, audit and inspection readiness, and strategic medical writing. He serves as a key interface for both internal teams and external clients, providing trusted scientific counsel.","A strong believer in mentorship and team empowerment, Dr. Raza is known for building high-performing medical teams rooted in a culture of quality. At OrciMed, he leads the medical function and drives strategic initiatives to deliver high-quality, cost-effective solutions while engaging closely with clients to expand offerings into medically driven verticals."]
  },
  "rob-petrie":{
    "name":"Rob Petrie",
    "role":"Chief Innovation Officer",
    "profilePic":"/rob.png",
    "headings":["Driving Innovation Across Clinical Research","Career Journey and Global Leadership","Expertise in Global IT Strategy and Innovation","Academic Credentials and Strategic Insight","Commitment to Client-Centric Innovation"],
    "info":["Rob brings over 30 years of global experience in clinical research, with a distinguished career focused on aligning technology and innovation with operational excellence. As Chief Innovation Officer at OrciMed Life Sciences, Rob leads the development and execution of advanced technology strategies aimed at optimizing internal processes and enhancing client service delivery.","Rob began his career at Life Science Research in the UK before transitioning to the United States, where he managed IT teams supporting diverse areas such as Phase I clinical operations, bioanalytical labs, GMP environments, and central laboratory systems. In 2015, he was appointed Chief Technology Officer at PPD, where he provided enterprise-wide leadership in technology strategy, innovation, and digital services across a 33,000-person global organization. He successfully led a worldwide IT team of over 700 professionals operating across five continents.","Throughout his career, Rob has demonstrated a consistent ability to scale technology infrastructure, lead digital transformation, and build high-performing offshore centers in Eastern Europe and the Asia-Pacific region. His expertise spans IT governance, enterprise solutions, digital automation, and operational intelligence—critical enablers of OrciMed’s innovation-driven approach to service delivery.","Rob holds a Bachelor’s degree in Computer Science from the UK, an MBA from the USA, and an Executive Certificate in Strategy & Innovation from the Massachusetts Institute of Technology (MIT). His educational background, combined with practical leadership experience, empowers him to bridge the gap between technological advancement and business impact.","At OrciMed, Rob is responsible not only for internal innovation but also for aligning technology solutions directly with client objectives. His commitment to strategic innovation ensures that OrciMed remains agile, efficient, and future-ready in an ever-evolving healthcare landscape."]
  },
  "dr-someshwar-komuravelly":{
    "name":"Dr. Someshwar Komuravelly",
    "role":"Chief Development Officer",
    "profilePic":"/someshawar.png",
    "headings":["Steering Growth and Strategic Development","Diverse Industry Experience and Business Acumen","Driving Business Expansion and Customer Engagement","Strategic Vision and Operational Excellence","Expertise in Drug Development and Portfolio Strategy"],
    "info":["As Chief Development Officer at OrciMed Life Sciences, Dr. Someshwar is responsible for leading the company’s overall development strategy, encompassing branding, marketing, sales, and external partnerships. His leadership plays a pivotal role in shaping and executing the organization’s long-term growth trajectory.","With a career spanning multiple domains, Dr. Someshwar has held several influential positions, particularly in the pharmaceutical manufacturing industry. His versatile background equips him with a strong understanding of operations, finance, and business development, enabling him to make informed decisions that foster sustainable growth.","Dr. Someshwar is accountable for conceptualizing and implementing dynamic growth plans that accelerate OrciMed’s market presence. His role involves maintaining high-value relationships with clients, affiliates, and senior stakeholders, ensuring seamless alignment between business goals and strategic initiatives.","With a keen focus on strategy development and stakeholder engagement, Dr. Someshwar contributes significantly to OrciMed’s visibility within the healthcare and life sciences community. His ability to align customer communications with broader organizational goals strengthens the company’s position as a trusted partner in the industry.","Dr. Someshwar brings a deep understanding of all phases of drug development, which enhances his ability to drive portfolio planning and resource optimization. His practical insights and strategic foresight have proven invaluable in aligning scientific innovation with commercial success."]
  },
  "swetha-tatineni":{
    "name":"Swetha Tatineni",
    "role":"Director - Support Functions",
    "profilePic":"/swetha.png",
    "headings":["Extensive Experience in Service Industry","Strong Leadership at ICICI Bank","Fostering Employee Relationships and Organizational Success"],
    "info":["With over 20 years of experience in the service industry, Swetha is responsible for managing human resources and directing all employee-related functions at OrciMed Life Sciences. Her role includes strategizing, coordinating, and overseeing the company’s support functions.","Swetha brings 18 years of experience from ICICI Bank, where she held various roles, progressing from an associate to key managerial positions. Her background in customer service management has provided her with deep expertise in ensuring high standards of customer satisfaction, communication, and relationship management.","Swetha’s customer-centric approach extends to employee management, where she plays a pivotal role in fostering strong, positive relationships within the company. Her ability to create a supportive work environment contributes significantly to OrciMed’s success."]
  }
}