{
  "savita-ravindra-gupta":{
    "name":"Savita Ravindra Gupta",
    "role":"Senior Manager QA",
    "profilePic":"/savitha.png",
      "info":["Savita Gupta has more than 16+ years of global/ international industry experience working in the Pharma/ Life Science/ Clinical Service Organization industry. With a focus on Quality, she has specialized in audits & inspection management and has gained a wealth of knowledge through various roles with companies such as ADVANZ Pharma, Adamas Consulting, Cognizant, TCS, Johnson & Johnson, and Piramal.",
      "She has experience and knowledge of pharmaceutical quality processes, clinical research and Pharmacovigilance, Data Management, Regulatory Affairs, and Biostatistics & Programming. She has comprehensive knowledge of regulatory requirements including EMA, US-FDA, MHRA, PMDA, Hungarian Health Authority, ANSM, HALMED, FAMHP, SWISSMEDIC, NOMA, and Health Canada.",
      "As the Quality Head, Savita is responsible for Quality and Compliance strategies that drive efficiency and quality operations within OrciMed and support our customers and regulatory needs.",
      "Her extensive exposure to global audits/ regulatory inspection has given her the experience and understanding required to achieve a robust system with an exceptional eye for detail. Highly motivated & passionate individual who takes great pride in all that she does.",
      "Savita has a BSc in Life Sciences and Biochemistry from Mumbai University.",
      "She has an ISO 9001:2015 Lead Auditor and ISO 13485:2016 Lead Auditor Medical Device Certification. She completed Advanced Pharmacovigilance Auditing by WCS and Women Leadership Training by Full Circle and Leadership -Practical Leadership Skills by AGUA Women’s Leadership"]
  },
  "mr-suman-maarisetty":{
    "name":"Mr. Suman Maarisetty",
    "role":"Chief Executive Officer",
    "profilePic":"/suman.png",
    "info":["Suman Maarisetty has a proven performance credentials over the past 15 years in the pharmaceutical industry. He is spearheading OrciMed Life Sciences to its next growth orbit as the Chief Executive Officer of the company. Prior to joining OrciMed Life Sciences, Suman has co-founded and sculpted Vigi Medsafe, a niche pharmacovigilance service provider in the health care sector. His quest for perfection and relentless focus has set the operations on its track within one year of its inception. He has been instrumental in setting up the entire end-to-end capability for service delivery, operations and lead the team of highly accomplished scientific talent to deliver various complex project deliverables with high quality. Vigi MedSafe was conceived in 2013 with humble beginning and the company exponentially transitioned to industry leading clinical research organization through 2014 to 2019 attaining global platform with unparalleled customer partnerships and thoughtful proficiency in influential healthcare delivery and was acquired by PPD Inc in 2019. Suman, early in his career, has worked in regulatory agency-Medicines and Healthcare products Regulatory Agency (MHRA) and ingeniously utilized the period of his career spanning across vital and enriching engagements with global pharmaceutical organizations like PPD (a part of Thermo Fisher Scientific), Novartis and Eli Lilly. His strong scientific skills and passion for business gives him an edge with complete end-to-end visibility, right from customer audit due diligence to customer engagement for quality deliverables. Suman’s management strategies, revolutionary vision and unique style of engagement with multilevel stakeholders makes him a favourite leader among his customers and employees."]
  },
  "dave-agrella":{
    "name":"Dave Agrella",
    "role":"Chief Revenue Officer",
    "profilePic":"/Dave.png",
    "info":["Dave Agrella brings 30+ years of experience in clinical trials, marketed products and technology. Working as the Chief Revenue Officer, Dave is responsible for ensuring OricMed delivers the highest quality service at the best value for our clients.",

"Dave comes to OrciMed after 20 years at PPD/ThermoFisher. While at PPD, Dave had several roles in laboratory operations, technology and clinical operations. Most recently, Dave lead the FSP and Government organizations achieving significant growth. Dave brings a commitment to transparency and client satisfaction to OrciMed. Understanding our client’s requirements and aligning our service delivery to their strategic goals is of utmost importance. Dave offers a broad and unique perspective on the clinical market today giving our clients access to an industry thought leader in outsourcing strategies and implementations of operations and technology. Dave is based in Wilmington NC and lives with his wife and three kids"]
  },
  "dr-raza-mohammed":{
    "name":"Dr. Raza Mohammad",
    "role":"Chief Scientific Officer",
    "profilePic":"/Raza.png",
    "info":["Dr Raza Mohammed is a physician by training and is a qualified pharmacologist and diabetologist. He has 10 years of clinical experience and nearly 15 years of experience in pharmacovigilance spanning across the spectrum of big pharma and large multinational CRO. He was responsible, until a few years ago, for co-founding a pharmacovigilance company and leading its medical division with a strong team of physicians that rapidly grew in a few years. Raza’s experience spans multiple therapeutic areas across products that are in clinical development, post-marketed and generic products. He is a subject matter expert in performing medical review of single cases, aggregate reports, literature surveillance, signal detection, risk management plans, core data sheet updates, responding to health authority queries, medical writing, providing internal and external audit and inspection support, and extending medical expertise to clients. Raza is a strong people’s manager with a passion for quality ensuring that the clients receive deliverables of the highest scientific value thereby culminating in safe and effective medicines for humans. At OrciMed Life Sciences, Raza represents as the Chief Scientific Officer being responsible for leading the medical team and its operations, developing, and implementing strategies for high quality and cost-effective deliverables, business expansion to include verticals requiring medical input and expertise, and customer engagement."]
  },
  "rob-petrie":{
    "name":"Rob Petrie",
    "role":"Chief Innovation Officer",
    "profilePic":"/rob.png",
    "info":["Rob Petrie has more than 30 years of industry experience working in clinical research. Working as the CIO, Rob is responsible for all technology and innovation strategies that drive efficiency and quality operations within OrciMed and for directly supporting our customers’ needs.",
"Rob started his career working at Life Science Research in the UK. He then transferred to the USA managing IT teams in the Pharmaco Phase 1 Clinic, BioAnalyical, GMP and Central Lab groups. Rob took the lead IT role at PPD as Chief Technology Officer in 2015 providing technology strategy, innovation and services across the 33,000-person global organization. Rob was responsible for managing a large technology organization of more than 700 global technology staff across five continents.",
"Rob has extensive experience building high performing offshore labor centers in Eastern Europe and Asia/Pac.",
"Rob has a BS in Computer Science (UK); MBA (USA), Executive Certificate in Strategy & Innovation MIT."]
  },
  "dr-someshwar-komuravelly":{
    "name":"Dr. Someshwar Komuravelly",
    "role":"Chief Development Officer",
    "profilePic":"/someshawar.png",
    "info":["Someshwar carries the responsibility of overall development for OrciMed Life Sciences including branding, marketing and sales. He has successfully served in various influential positions including his immense contributions in pharmaceutical manufacturing industry. He is accountable for articulating and implementing rapid and continuing developmental growth plans, along with handling relations with customers, affiliates of the ventures and senior leadership. He has extensive understanding of operations and finance by the virtue of his multifaceted experiences in various business domains.",
"His foresight in strategy development and stakeholder engagement shall greatly contribute in maintaining OrciMed Life Sciences associations and communications with customers and the broader community. His vast practice level expertise encompassing all phases of drug development has principally facilitated his flair in portfolio development with strategic planning and resource optimization."]
  },
  "swetha-tatineni":{
    "name":"Swetha Tatineni",
    "role":"Head-Support Functions",
    "profilePic":"/swetha.png",
    "info":["Swetha comes with 20+ years of experience in the Service Industry. Swetha is primarily responsible for managing Human resources to strategize, coordinate, and direct the employee-related functions along with all the Support functions of OrciMed.",

"Swetha comes to OrciMed after 18 years at ICICI Bank. While at ICICI Bank, she handled diverse profiles that required adaptability, problem-solving skills, and a keen understanding of industry-specific challenges. She has handled various profiles starting from Associate to key Managerial positions and has a broad understanding of deep Customer Service dynamics. This involves ensuring a high standard of customer satisfaction, implementing effective communication channels, and addressing customer queries and concerns promptly. She plays a crucial role in creating customer-centric approaches, managing customer relationships, and enhancing the overall experience.",

"Swetha’s well-versed background in handling various aspects of customer service positions her as a valuable member who can contribute to OrciMed’s success by fostering strong and cordial employee relationships."]
  }
}